app/controllers/items_controller.rb

  def set_todo
    @todo = Todo.find(params[:todo_id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]